stm32-hotspot/ST-wireless-services-workshop/WBA55_TH_sensor_FW/STM32_WPAN/App/hts_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    HTS_app.c
  * @author  MCD Application Team
  * @brief   HTS_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "log_module.h"
#include "app_ble.h"
#include "ll_sys_if.h"
#include "dbg_trace.h"
#include "hts_app.h"
#include "hts.h"
#include "stm32_rtos.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  Temm_INDICATION_OFF,
  Temm_INDICATION_ON,
  Int_NOTIFICATION_OFF,
  Int_NOTIFICATION_ON,
  Mei_INDICATION_OFF,
  Mei_INDICATION_ON,
  /* USER CODE BEGIN Service1_APP_SendInformation_t */

  /* USER CODE END Service1_APP_SendInformation_t */
  HTS_APP_SENDINFORMATION_LAST
} HTS_APP_SendInformation_t;

typedef struct
{
  HTS_APP_SendInformation_t     Temm_Indication_Status;
  HTS_APP_SendInformation_t     Int_Notification_Status;
  HTS_APP_SendInformation_t     Mei_Indication_Status;
  /* USER CODE BEGIN Service1_APP_Context_t */
  HTS_TemperatureValue_t        IntermediateTemperatureChar;
  HTS_TemperatureValue_t        TemperatureMeasurementChar;
  uint16_t                      MeasurementIntervalChar;
  UTIL_TIMER_Object_t           TimerIntTemp_Id;
  UTIL_TIMER_Object_t           TimerMeasurement_Id;
  uint8_t                       TimerMeasurementStarted;
  UTIL_TIMER_Object_t           TimerMeasInt_Id;
  uint32_t                      StartTick;
  /* USER CODE END Service1_APP_Context_t */
  uint16_t              ConnectionHandle;
} HTS_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEFAULT_HTS_MEASUREMENT_INTERVAL       (10000)  /**< 10s */
#define DEFAULT_HTS_INT_MEASUREMENT_INTERVAL   (1000)  /**< 1s */
#define DEFAULT_TEMPERATURE_TYPE           TT_Armpit
#define NB_SAVED_MEASURES                  10
/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */
extern SHT40AD1B_Object_t Temp_Sensor;

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static HTS_APP_Context_t HTS_APP_Context;

uint8_t a_HTS_UpdateCharData[247];

/* USER CODE BEGIN PV */
static HTS_TemperatureValue_t HTS_Measurement[NB_SAVED_MEASURES];
static int8_t HTS_CurrentIndex, HTS_OldIndex;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void HTS_Temm_SendIndication(void);
static void HTS_Int_SendNotification(void);
static void HTS_Mei_SendIndication(void);

/* USER CODE BEGIN PFP */
static void HTS_APP_UpdateMeasurementInterval_timCb(void *arg);
static void HTS_APP_UpdateIntermediateTemperature_timCb(void *arg);
static void HTS_APP_Measurements_timCb(void *arg);

static void HTS_APP_IntermediateTemperature(void);
static void HTS_APP_MeasurementInterval(void);
static void HTS_APP_Measurement(void);
static void HTS_APP_Update_TimeStamp(HTS_TimeStamp_t *p_time_stamp, uint8_t flag_measurement);
static void HTS_APP_Suppress(void);
static void HTS_APP_Store(void);

static uint32_t HTS_FloatToIEEE11073(float temp_c);

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void HTS_Notification(HTS_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_Notification_1 */

  /* USER CODE END Service1_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_Notification_Service1_EvtOpcode */

    /* USER CODE END Service1_Notification_Service1_EvtOpcode */

    case HTS_TEMM_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char1_INDICATE_ENABLED_EVT */
      HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_ON;
      if(HTS_APP_Context.TimerMeasurementStarted == 0)
      {
        HTS_APP_Measurement();
        UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
        UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, DEFAULT_HTS_MEASUREMENT_INTERVAL);
        HTS_APP_Context.TimerMeasurementStarted = 1;
      }
      /* USER CODE END Service1Char1_INDICATE_ENABLED_EVT */
      break;

    case HTS_TEMM_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char1_INDICATE_DISABLED_EVT */
      HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
      HTS_APP_Context.TimerMeasurementStarted = 0;
      /* USER CODE END Service1Char1_INDICATE_DISABLED_EVT */
      break;

    case HTS_MNBS_READ_EVT:
      /* USER CODE BEGIN Service1Char2_READ_EVT */

      /* USER CODE END Service1Char2_READ_EVT */
      break;

    case HTS_INT_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char3_NOTIFY_ENABLED_EVT */
      LOG_INFO_APP("HTS_INT_NOTIFY_ENABLED_EVT\n");
      HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_ON;
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerIntTemp_Id);
      UTIL_TIMER_Start(&HTS_APP_Context.TimerIntTemp_Id);
      /* USER CODE END Service1Char3_NOTIFY_ENABLED_EVT */
      break;

    case HTS_INT_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char3_NOTIFY_DISABLED_EVT */
      LOG_INFO_APP("HTS_INT_NOTIFY_DISABLED_EVT\n");
      HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_OFF;
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerIntTemp_Id);
      /* USER CODE END Service1Char3_NOTIFY_DISABLED_EVT */
      break;

    case HTS_MEI_READ_EVT:
      /* USER CODE BEGIN Service1Char4_READ_EVT */
      {
        LOG_INFO_APP("HTS_MEI_READ_EVT\n");
        if(p_Notification->RangeInterval != 0)
        {
          HTS_APP_Context.MeasurementIntervalChar = p_Notification->RangeInterval;
          LOG_INFO_APP("HTS_MEI_READ_EVT: %d \n", 
                       p_Notification->RangeInterval);
          if(HTS_APP_Context.Temm_Indication_Status != Temm_INDICATION_OFF)
          {
            if(HTS_APP_Context.TimerMeasurementStarted == 0)
            {
              UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                                         (HTS_APP_Context.MeasurementIntervalChar)*1000);
              HTS_APP_Context.TimerMeasurementStarted = 1;
            }
            else
            {
              UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
              UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                                         (HTS_APP_Context.MeasurementIntervalChar)*1000);
            }
          }
        }
        else
        {
          UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
          HTS_APP_Context.TimerMeasurementStarted = 0;
        }
      }
      /* USER CODE END Service1Char4_READ_EVT */
      break;

    case HTS_MEI_WRITE_EVT:
      /* USER CODE BEGIN Service1Char4_WRITE_EVT */

      /* USER CODE END Service1Char4_WRITE_EVT */
      break;

    case HTS_MEI_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char4_INDICATE_ENABLED_EVT */
      LOG_INFO_APP("HTS_MEI_INDICATE_ENABLED_EVT\n");
      HTS_APP_Context.Mei_Indication_Status = Mei_INDICATION_ON;
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasInt_Id);
      UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasInt_Id, DEFAULT_HTS_MEASUREMENT_INTERVAL*3);
      /* USER CODE END Service1Char4_INDICATE_ENABLED_EVT */
      break;

    case HTS_MEI_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char4_INDICATE_DISABLED_EVT */
      LOG_INFO_APP("HTS_MEI_INDICATE_DISABLED_EVT\n");
      HTS_APP_Context.Mei_Indication_Status = Mei_INDICATION_OFF;
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasInt_Id);
      /* USER CODE END Service1Char4_INDICATE_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_Notification_default */

      /* USER CODE END Service1_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service1_Notification_2 */

  /* USER CODE END Service1_Notification_2 */
  return;
}

void HTS_APP_EvtRx(HTS_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_APP_EvtRx_1 */

  /* USER CODE END Service1_APP_EvtRx_1 */

