stm32-hotspot/ST-wireless-services-workshop/WBA55_TH_sensor_FW/STM32_WPAN/App/hts_app.c
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_APP_EvtRx_Service1_EvtOpcode */

    /* USER CODE END Service1_APP_EvtRx_Service1_EvtOpcode */
    case HTS_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_CONN_HANDLE_EVT */

      /* USER CODE END Service1_APP_CONN_HANDLE_EVT */
      break;

    case HTS_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_DISCON_HANDLE_EVT */
      UTIL_TIMER_Stop(&(HTS_APP_Context.TimerMeasurement_Id));
      UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, DEFAULT_HTS_MEASUREMENT_INTERVAL);
      /* USER CODE END Service1_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_APP_EvtRx_default */

      /* USER CODE END Service1_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service1_APP_EvtRx_2 */

  /* USER CODE END Service1_APP_EvtRx_2 */

  return;
}

void HTS_APP_Init(void)
{
  UNUSED(HTS_APP_Context);
  HTS_Init();

  /* USER CODE BEGIN Service1_APP_Init */
  HTS_Data_t msg_conf;

  HTS_APP_Context.StartTick = HAL_GetTick();
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_MEAS_REQ_ID, UTIL_SEQ_RFU, HTS_APP_Measurement);
  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_INTERMEDIATE_TEMPERATURE_REQ_ID, UTIL_SEQ_RFU, HTS_APP_IntermediateTemperature);
  UTIL_SEQ_RegTask( 1<< CFG_TASK_HTS_MEAS_INTERVAL_REQ_ID, UTIL_SEQ_RFU, HTS_APP_MeasurementInterval);

  /**
   * Initialize Flags
   */
  HTS_APP_Context.TemperatureMeasurementChar.Flags = (uint8_t)NO_FLAGS;
  HTS_APP_Context.IntermediateTemperatureChar.Flags = (uint8_t)NO_FLAGS;

  HTS_APP_Context.TemperatureMeasurementChar.Flags |= (uint8_t)SENSOR_TIME_STAMP_PRESENT;
  HTS_APP_Context.IntermediateTemperatureChar.Flags |= (uint8_t)SENSOR_TIME_STAMP_PRESENT;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year = 2017;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month = 4;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day = 1;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours = 0;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes = 0;
  HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds  = 0;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year = 2017;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Month = 4;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Day = 1;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Hours = 0;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Minutes = 0;
  HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Seconds  = 0;
  /**
   * Initialize Measurement Interval
   */
  msg_conf.Length = 1;
  if(BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE == 0)
    a_HTS_UpdateCharData[0] = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE + 10;
  else
    a_HTS_UpdateCharData[0] = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE + 9;

  HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  HTS_UpdateValue(HTS_MEI, &msg_conf);
  /**
   * Create timer for Health Temperature Measurement Interval
   */
  UTIL_TIMER_Create(&(HTS_APP_Context.TimerMeasInt_Id), DEFAULT_HTS_INT_MEASUREMENT_INTERVAL, UTIL_TIMER_PERIODIC, &HTS_APP_UpdateMeasurementInterval_timCb, 0);
  /**
   * Set Temperature Measurement Type
   */
  HTS_APP_Context.TemperatureMeasurementChar.TemperatureType = DEFAULT_TEMPERATURE_TYPE;
  HTS_APP_Context.IntermediateTemperatureChar.TemperatureType = DEFAULT_TEMPERATURE_TYPE;
  a_HTS_UpdateCharData[0] = HTS_APP_Context.TemperatureMeasurementChar.TemperatureType;
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  HTS_UpdateValue(HTS_MNBS, &msg_conf);
  
  HTS_APP_Context.TemperatureMeasurementChar.Flags |= (uint8_t)SENSOR_TEMPERATURE_TYPE_PRESENT;
  HTS_APP_Context.IntermediateTemperatureChar.Flags |= (uint8_t)SENSOR_TEMPERATURE_TYPE_PRESENT;
  HTS_APP_Context.Int_Notification_Status = Int_NOTIFICATION_OFF;

  /**
   * Create timer for Health Temperature Measurement
   */
  UTIL_TIMER_Create(&(HTS_APP_Context.TimerMeasurement_Id), DEFAULT_HTS_MEASUREMENT_INTERVAL, UTIL_TIMER_PERIODIC, &HTS_APP_Measurements_timCb, 0);
  HTS_APP_Context.Temm_Indication_Status = Temm_INDICATION_OFF;

  /**
   * Create timer for Health Temperature Intermediate Temperature
   */
  UTIL_TIMER_Create(&(HTS_APP_Context.TimerIntTemp_Id), DEFAULT_HTS_INT_MEASUREMENT_INTERVAL, UTIL_TIMER_PERIODIC, HTS_APP_UpdateIntermediateTemperature_timCb, 0);

  HTS_CurrentIndex = -1;
  HTS_OldIndex = 0;

  UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, DEFAULT_HTS_MEASUREMENT_INTERVAL);
  /* USER CODE END Service1_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
static void HTS_APP_UpdateMeasurementInterval_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_HTS_MEAS_INTERVAL_REQ_ID,CFG_SEQ_PRIO_0);
  return;
}

static void HTS_APP_Measurements_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1<<CFG_TASK_HTS_MEAS_REQ_ID, CFG_SEQ_PRIO_0);

  return;
}

static void HTS_APP_UpdateIntermediateTemperature_timCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_HTS_INTERMEDIATE_TEMPERATURE_REQ_ID, CFG_SEQ_PRIO_0);
  
  return;
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void HTS_Temm_SendIndication(void) /* Property Indication */
{
  HTS_APP_SendInformation_t indication_on_off = Temm_INDICATION_OFF;
  HTS_Data_t hts_indication_data;

  hts_indication_data.p_Payload = (uint8_t*)a_HTS_UpdateCharData;
  hts_indication_data.Length = 0;

  /* USER CODE BEGIN Service1Char1_IS_1 */

