stm32-hotspot/ST-wireless-services-workshop/WBA55_TH_sensor_FW/STM32_WPAN/App/hts_app.c
  /* USER CODE END Service1Char1_IS_1 */

  if (indication_on_off != Temm_INDICATION_OFF)
  {
    HTS_UpdateValue(HTS_TEMM, &hts_indication_data);
  }

  /* USER CODE BEGIN Service1Char1_IS_Last */

  /* USER CODE END Service1Char1_IS_Last */

  return;
}

__USED void HTS_Int_SendNotification(void) /* Property Notification */
{
  HTS_APP_SendInformation_t notification_on_off = Int_NOTIFICATION_OFF;
  HTS_Data_t hts_notification_data;

  hts_notification_data.p_Payload = (uint8_t*)a_HTS_UpdateCharData;
  hts_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char3_NS_1 */

  /* USER CODE END Service1Char3_NS_1 */

  if (notification_on_off != Int_NOTIFICATION_OFF)
  {
    HTS_UpdateValue(HTS_INT, &hts_notification_data);
  }

  /* USER CODE BEGIN Service1Char3_NS_Last */

  /* USER CODE END Service1Char3_NS_Last */

  return;
}

__USED void HTS_Mei_SendIndication(void) /* Property Indication */
{
  HTS_APP_SendInformation_t indication_on_off = Mei_INDICATION_OFF;
  HTS_Data_t hts_indication_data;

  hts_indication_data.p_Payload = (uint8_t*)a_HTS_UpdateCharData;
  hts_indication_data.Length = 0;

  /* USER CODE BEGIN Service1Char4_IS_1 */

  /* USER CODE END Service1Char4_IS_1 */

  if (indication_on_off != Mei_INDICATION_OFF)
  {
    HTS_UpdateValue(HTS_MEI, &hts_indication_data);
  }

  /* USER CODE BEGIN Service1Char4_IS_Last */

  /* USER CODE END Service1Char4_IS_Last */

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
void HTS_APP_Measurement(void)
{
  uint32_t measurement;
  tBleStatus ret;
  HTS_Data_t msg_conf;
  float temp_c;


  uint8_t atm_value[
                    1 +         /* Flags */
                    4 +         /* MeasurementValue */
                    7 +         /* TimeStamp */
                    1           /* TemperatureType */
                    ];
  uint8_t tm_char_length;


  if (SHT40AD1B_TEMP_GetTemperature(&Temp_Sensor, &temp_c) != SHT40AD1B_OK)
  {
    LOG_INFO_APP("SHT40AD1B_TEMP_GetTemperature failed in HTS_APP_Measurement\n");
    return;
  }

  LOG_INFO_APP("Sensor temperature: %.2f C\n", temp_c);

  measurement = HTS_FloatToIEEE11073(temp_c);
  
  HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue = measurement;
  LOG_INFO_APP("HTS_APP_Measurement: %d \n", (int)measurement);

  HTS_APP_Update_TimeStamp(&(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp), 1);

  if((APP_BLE_Get_Server_Connection_Status() == APP_BLE_CONNECTED_SERVER) &&
     (HTS_APP_Context.TimerMeasurementStarted == 1))
  {
    uint32_t interval;
    
    UTIL_TIMER_Stop(&HTS_APP_Context.TimerIntTemp_Id);
    
    if(HTS_Measurement[HTS_OldIndex].MeasurementValue > 0)
    {
      LOG_INFO_APP ("Send stored measurement %d\n", HTS_OldIndex);  
      HTS_APP_Suppress();
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
      
      if(HTS_APP_Context.MeasurementIntervalChar > 0)
        interval = (HTS_APP_Context.MeasurementIntervalChar)*1000;
      else
        interval = 1000;
      
      UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                                 interval);
    }
    else
    {
      UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
      if(HTS_APP_Context.MeasurementIntervalChar > 0)
        interval = (HTS_APP_Context.MeasurementIntervalChar)*1000;
      else
        interval = DEFAULT_HTS_MEASUREMENT_INTERVAL;
      
      UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                                 interval);

      LOG_INFO_APP("HTS_APP_Measurement: %d \n", (int)measurement);
      
      /**
       * Flags update
       */
      atm_value[0] = (uint8_t)HTS_APP_Context.TemperatureMeasurementChar.Flags;

      /**
       *  Temperature Measurement Value
       */
      atm_value[1] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue);
      atm_value[2] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 8);
      atm_value[3] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 16);
      atm_value[4] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.MeasurementValue >> 24);

      tm_char_length = 5;

      if (HTS_APP_Context.TemperatureMeasurementChar.Flags &  SENSOR_TIME_STAMP_PRESENT)
      {
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Year >> 8);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Month);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Day);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Hours);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Minutes);
        tm_char_length++;
        atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TimeStamp.Seconds);
        tm_char_length++;
      }

      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.TemperatureMeasurementChar.TemperatureType);
      tm_char_length++;

      /**
       * Update Temperature Measurement Value
       */
      msg_conf.p_Payload = atm_value;
      msg_conf.Length = tm_char_length;
      ret = HTS_UpdateValue(HTS_TEMM, &msg_conf);
      if(ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("HTS_UpdateValue fails\n");
      }
    }
  }
  else
  {
    UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerIntTemp_Id, DEFAULT_HTS_INT_MEASUREMENT_INTERVAL);
    HTS_APP_Store();
  }

  return;
}

static void HTS_APP_IntermediateTemperature(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t atm_value[
                    1 +         /* Flags */
                    4 +         /* MeasurementValue */
                    7 +         /* TimeStamp */
                    1           /* TemperatureType */
                    ];
  uint8_t tm_char_length;
  float temp_c;

  if (SHT40AD1B_TEMP_GetTemperature(&Temp_Sensor, &temp_c) != SHT40AD1B_OK)
  {
	  LOG_INFO_APP("SHT40AD1B_TEMP_GetTemperature failed in HTS_APP_Measurement\n");
      return;
  }

  LOG_INFO_APP("Intermediate temperature: %.2f C\n", temp_c);

  /* Encode in IEEE11073 format */
  HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue = HTS_FloatToIEEE11073(temp_c);


  HTS_APP_Update_TimeStamp(&(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp), 0);

  if(HTS_APP_Context.Int_Notification_Status == Int_NOTIFICATION_ON)
  {
	    LOG_INFO_APP("HTS_APP_IntermediateTemperature (IEEE11073 raw): 0x%08lX\n",
	                 HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);

	    /* Flags */

    atm_value[0] = (uint8_t)HTS_APP_Context.IntermediateTemperatureChar.Flags;

    /**
     *  Intermediate Temperature Measurement Value
     */
    atm_value[1] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue);
    atm_value[2] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 8);
    atm_value[3] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 16);
    atm_value[4] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.MeasurementValue >> 24);

    tm_char_length = 5;

    if (HTS_APP_Context.IntermediateTemperatureChar.Flags &  SENSOR_TIME_STAMP_PRESENT)
    {
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Year >> 8);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Month);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Day);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Hours);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Minutes);
      tm_char_length++;
      atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TimeStamp.Seconds);
      tm_char_length++;
    }

