stm32-hotspot/ST-wireless-services-workshop/WBA55_TH_sensor_FW/STM32_WPAN/App/hts_app.c
    atm_value[tm_char_length] = (uint8_t)(HTS_APP_Context.IntermediateTemperatureChar.TemperatureType);
    tm_char_length++;

    /**
     * Update Intermediate Temperature Measurement Value
     */
    msg_conf.p_Payload = atm_value;
    msg_conf.Length = tm_char_length;

    ret = HTS_UpdateValue(HTS_INT, &msg_conf);
    if(ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("HTS_UpdateValue fails\n");
    }
  }
  return;
}

static void HTS_APP_MeasurementInterval(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t htm_char_length = 0;

  if(HTS_APP_Context.MeasurementIntervalChar < BLE_CFG_HTS_TEMPERATURE_INTERVAL_MAX_VALUE)
  {
    HTS_APP_Context.MeasurementIntervalChar += 1;
  }  
  else
  {
    HTS_APP_Context.MeasurementIntervalChar = BLE_CFG_HTS_TEMPERATURE_INTERVAL_MIN_VALUE;
  }
  LOG_INFO_APP("Measurement Interval: %d \n", HTS_APP_Context.MeasurementIntervalChar);

  a_HTS_UpdateCharData[htm_char_length] = (uint8_t)(HTS_APP_Context.MeasurementIntervalChar & 0xFF);
  htm_char_length++;
  a_HTS_UpdateCharData[htm_char_length] = (uint8_t)(HTS_APP_Context.MeasurementIntervalChar >> 8);
  htm_char_length++;

  /**
   * Update Measurement Interval Value
   */
  msg_conf.p_Payload = a_HTS_UpdateCharData;
  msg_conf.Length = htm_char_length;
  ret = HTS_UpdateValue(HTS_MEI, &msg_conf);
  if(ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("HTS_UpdateValue fails\n");
  }

  if(HTS_APP_Context.TimerMeasurementStarted == 0)
  {
    UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                               (HTS_APP_Context.MeasurementIntervalChar)*1000);
    HTS_APP_Context.TimerMeasurementStarted = 1;
  }
  else
  {
    UTIL_TIMER_Stop(&HTS_APP_Context.TimerMeasurement_Id);
    UTIL_TIMER_StartWithPeriod(&HTS_APP_Context.TimerMeasurement_Id, 
                               (HTS_APP_Context.MeasurementIntervalChar)*1000);
  }
  
  return;
}


static void HTS_APP_Update_TimeStamp(HTS_TimeStamp_t *p_time_stamp, uint8_t flag_measurement)
{
  if(flag_measurement)
  {
    if(HTS_APP_Context.MeasurementIntervalChar > 0)
      p_time_stamp->Seconds += 
        HTS_APP_Context.MeasurementIntervalChar;
    else
      p_time_stamp->Seconds += 
        (DEFAULT_HTS_MEASUREMENT_INTERVAL / 1000);
  }
  else
  {
    p_time_stamp->Seconds += 
      /*10 * */(DEFAULT_HTS_INT_MEASUREMENT_INTERVAL / 1000);
  }    
  
  while(p_time_stamp->Seconds >= 60)
  {
    p_time_stamp->Seconds -= 60;
    p_time_stamp->Minutes += 1;
  }
  while(p_time_stamp->Minutes >= 60)
  {
    p_time_stamp->Minutes -= 60;
    p_time_stamp->Hours += 1;
  }
  while(p_time_stamp->Hours >= 24)
  {
    p_time_stamp->Hours -= 24;
    p_time_stamp->Day += 1;
  }
  while(p_time_stamp->Day >= 31)
  {
    p_time_stamp->Day -= 31;
    p_time_stamp->Month += 1;
  }
  while(p_time_stamp->Month >= 12)
  {
    p_time_stamp->Month -= 11;
    p_time_stamp->Year += 1;
  }
}

static void HTS_APP_Store(void)
{
  HTS_CurrentIndex++;
  if(HTS_CurrentIndex == NB_SAVED_MEASURES)
  {
    HTS_CurrentIndex = 0;
  }
  if((HTS_CurrentIndex == HTS_OldIndex) && (HTS_Measurement[HTS_CurrentIndex].MeasurementValue > 0))
  {
    HTS_OldIndex = HTS_CurrentIndex + 1;
    if(HTS_OldIndex == NB_SAVED_MEASURES)
    {
      HTS_OldIndex = 0;
    }
  }
  LOG_INFO_APP ("Stored measurement %d, index of first measure saved: %d\n", 
                HTS_CurrentIndex, HTS_OldIndex);  
  memcpy(&HTS_Measurement[HTS_CurrentIndex], 
         &(HTS_APP_Context.TemperatureMeasurementChar), 
         sizeof(HTS_TemperatureValue_t)); 
}

static void HTS_APP_Suppress(void)
{
  tBleStatus ret;
  HTS_Data_t msg_conf;
  uint8_t length = 0;

  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].Flags;
  a_HTS_UpdateCharData[length++] = (HTS_Measurement[HTS_CurrentIndex].MeasurementValue) & 0xFF;
  a_HTS_UpdateCharData[length++] = ((HTS_Measurement[HTS_CurrentIndex].MeasurementValue) >> 8) & 0xFF;
  a_HTS_UpdateCharData[length++] = ((HTS_Measurement[HTS_CurrentIndex].MeasurementValue) >> 16) & 0xFF;
  a_HTS_UpdateCharData[length++] = ((HTS_Measurement[HTS_CurrentIndex].MeasurementValue) >> 24) & 0xFF;
  a_HTS_UpdateCharData[length++] = (HTS_Measurement[HTS_CurrentIndex].TimeStamp.Year) & 0xFF;
  a_HTS_UpdateCharData[length++] = ((HTS_Measurement[HTS_CurrentIndex].TimeStamp.Year) >> 8) & 0xFF;
  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].TimeStamp.Month;
  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].TimeStamp.Day;
  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].TimeStamp.Hours;
  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].TimeStamp.Minutes;
  a_HTS_UpdateCharData[length++] = HTS_Measurement[HTS_CurrentIndex].TimeStamp.Seconds;
  a_HTS_UpdateCharData[length++] = (uint8_t)(HTS_Measurement[HTS_CurrentIndex].TemperatureType);
  msg_conf.Length = length;
  msg_conf.p_Payload = a_HTS_UpdateCharData;

  ret = HTS_UpdateValue(HTS_TEMM, &msg_conf);
  if(ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("HTS_UpdateValue fails\n");
  }

  HTS_Measurement[HTS_OldIndex].MeasurementValue = 0;
  HTS_OldIndex++;
  if(HTS_OldIndex == NB_SAVED_MEASURES)
  {
    HTS_OldIndex = 0;
  }
}


static uint32_t HTS_FloatToIEEE11073(float temp_c)
{
  /* mantissa in 0.01 �C units */
  int32_t mantissa = (int32_t)roundf(temp_c * 100.0f);
  int8_t exponent = -2;  /* 10^-2 */

  uint32_t u_mantissa = (uint32_t)(mantissa & 0x00FFFFFF); /* 24-bit two's complement */
  uint32_t u_exponent = (uint32_t)((uint8_t)exponent);     /* 8-bit two's complement */

  return (u_mantissa | (u_exponent << 24));
}

/* USER CODE END FD_LOCAL_FUNCTIONS */
